src/cf/DataProcessors/ЯндексMQ2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЯндексMQ2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>_Endpoint</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_Version</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_Region</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_AccessKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_SecretKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_SecurityToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_РезультатПоследнегоЗапроса</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/ЯндексMQ2/Ext/ManagerModule.bsl
// Фабрика для создания объекта клиента
//
// Параметры:
//  ПараметрыКлиента - Структура:
//		* AccessKey		-	Строка	-	(обязательный) Идентификатор ключа
//		* MessageBody	-	Строка	-	(обязательный) Секретный ключ
//		* SecurityToken	-	Строка	-	(опционально) Временный токен доступа
//		* Endpoint		-	Строка	-	(опционально) Адрес сервиса
//		* Version		-	Строка	-	(опционально) Версия используемого протокола
//		* Region		-	Строка	-	(опционально) Регион сервиса 
// 
// Возвращаемое значение:
//  ОбработкаОбъект.ЯндексMQ2 - Экземпляр объекта обработки
//
Функция НовыйКлиент( Знач ПараметрыКлиента ) Экспорт
	
	УстановитьПривилегированныйРежим( Истина );
	
	Объект = Обработки.ЯндексMQ2.Создать();
	
	Если ПараметрыКлиента.Свойство( "AccessKey" ) Тогда
		Объект._AccessKey = ПараметрыКлиента.AccessKey;
	КонецЕсли;
	
	Если ПараметрыКлиента.Свойство( "SecretKey" ) Тогда
		Объект._SecretKey = ПараметрыКлиента.SecretKey;
	КонецЕсли;
	
	Если ПараметрыКлиента.Свойство( "SecurityToken" ) Тогда
		Объект._SecurityToken = ПараметрыКлиента.SecurityToken;
	КонецЕсли;
	
	Если ПараметрыКлиента.Свойство( "Endpoint" ) Тогда
		Объект._Endpoint = ПараметрыКлиента.Endpoint;
	КонецЕсли;
	
	Если ПараметрыКлиента.Свойство( "Version" ) Тогда
		Объект._Version = ПараметрыКлиента.Version;
	КонецЕсли;
	
	Если ПараметрыКлиента.Свойство( "Region" ) Тогда
		Объект._Region = ПараметрыКлиента.Region;
	КонецЕсли;

	Возврат Объект;
	
КонецФункции
